tests/load/reports/dashboard/statistics.json
{
  "GET /api/reports/jobs-by-status (CQRS Aggregation)" : {
    "transaction" : "GET /api/reports/jobs-by-status (CQRS Aggregation)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.169999999999998,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 4.0,
    "throughput" : 106.95187165775401,
    "receivedKBytesPerSec" : 22.351270053475936,
    "sentKBytesPerSec" : 20.889037433155078
  },
  "GET /api/health (CustomerAssetService)" : {
    "transaction" : "GET /api/health (CustomerAssetService)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5899999999999992,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 34.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 34.0,
    "throughput" : 103.95010395010395,
    "receivedKBytesPerSec" : 22.527936590436592,
    "sentKBytesPerSec" : 18.678534303534303
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.332857142857149,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 34.0,
    "pct3ResTime" : 36.0,
    "throughput" : 713.1940906775344,
    "receivedKBytesPerSec" : 216.13422535659703,
    "sentKBytesPerSec" : 138.40024834437085
  },
  "GET /api/health (DispatchService)" : {
    "transaction" : "GET /api/health (DispatchService)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.9600000000000012,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 3.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.990000000000009,
    "throughput" : 106.43959552953699,
    "receivedKBytesPerSec" : 25.972716538052154,
    "sentKBytesPerSec" : 19.125864821713677
  },
  "GET /api/health (JobService)" : {
    "transaction" : "GET /api/health (JobService)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.0299999999999996,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 5.990000000000009,
    "throughput" : 106.04453870625663,
    "receivedKBytesPerSec" : 22.97148396076352,
    "sentKBytesPerSec" : 19.054878048780488
  },
  "GET /api/health (ReportingService)" : {
    "transaction" : "GET /api/health (ReportingService)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.8999999999999999,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 2.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 2.0,
    "throughput" : 106.26992561105207,
    "receivedKBytesPerSec" : 23.032761025504783,
    "sentKBytesPerSec" : 19.09537725823592
  },
  "GET /api/health/db (MySQL Persistence)" : {
    "transaction" : "GET /api/health/db (MySQL Persistence)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.2699999999999996,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 35.68000000000029,
    "throughput" : 106.49627263045794,
    "receivedKBytesPerSec" : 28.374392638445155,
    "sentKBytesPerSec" : 19.448049787007456
  },
  "POST /api/auth/login (JWT Authentication)" : {
    "transaction" : "POST /api/auth/login (JWT Authentication)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 33.41000000000001,
    "medianResTime" : 33.0,
    "minResTime" : 31.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 36.0,
    "pct2ResTime" : 37.0,
    "pct3ResTime" : 38.99000000000001,
    "throughput" : 104.98687664041995,
    "receivedKBytesPerSec" : 78.93393208661418,
    "sentKBytesPerSec" : 27.477034120734906
  }
}